# RbsCurvetypeMultishapeTransitionRectovalParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsCurvetypeMultishapeTransitionRectovalParam Property
ParameterTypeId Class See Also
---
"Multi Shape Transition Rect to Oval"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsCurvetypeMultishapeTransitionRectovalParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsCurvetypeMultishapeTransitionRectovalParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsCurvetypeMultishapeTransitionRectovalParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace